/*

    - створити функцію яка повертає найменьше число з масиву
    - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
    - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
    Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
*/




//--------------------------------------------------------------------------------------------------------------------------

function getMin(arr) {
    return Math.min(...arr)
}

console.log(getMin([1,4,3,2,5,6,7,0]));


//--------------------------------------------------------------------------------------------------------------------------

function sum(arr) {
    return [...arr].reduce((acc, val) => acc + val, 0)
}

console.log(sum([1,2,3,4,5]))

//--------------------------------------------------------------------------------------------------------------------------



function swap(arr, index1, index2) {
    const temp = arr[index1];
    arr[index1] = arr[index2];
    arr[index2] = temp;
    
    return arr;
}

const arr = [11, 22, 33, 44];
const swappedArr = swap(arr, 0, 1);
console.log(swappedArr);


//--------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------