/*
   Логічні розгалуження:
    - Є змінна х, якій ви надаєте довільне числове значення.
    Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
    - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
    (в першу, другу, третю или четверту частину години).
    - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
    - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
    - Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.

    - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
    за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподібні, тобто приводиться до false)


*/


//--------------------------------------------------------------------------------------------------------------------------


let x = 10;
x = 1;
x = 0;
x = -3;


if (x != 0) {
    console.log("Вірно");
} else {
    console.log("Невірно");
}


//--------------------------------------------------------------------------------------------------------------------------

let time = 30; 

if (time >= 0 && time <= 14) {
  console.log('Час належить до першої четверті години');
} else if (time >= 15 && time <= 29) {
  console.log('Час належить до другої четверті години');
} else if (time >= 30 && time <= 44) {
  console.log('Час належить до третьої четверті години');
} else if (time >= 45 && time <= 60) {
  console.log('Час належить до третьої четверті години');
} else {
    console.log("Невірне значення для time");
}



//--------------------------------------------------------------------------------------------------------------------------

// let day = 15; // Приклад числа

// if (day >= 1 && day <= 10) {
//   console.log("Число потрапляє в першу декаду місяця");
// } else if (day >= 11 && day <= 20) {
//   console.log("Число потрапляє в другу декаду місяця");
// } else if (day >= 21 && day <= 31) {
//   console.log("Число потрапляє в третю декаду місяця");
// } else {
//   console.log("Невірне значення для day");
// }


//--------------------------------------------------------------------------------------------------------------------------

// let dayNumber = prompt("Введіть номер дня тижня (1-7):");
// let dayName;

// switch (dayNumber) {
//   case "1":
//     dayName = "Monday";
//     break;
//   case "2":
//     dayName = "Tuesday";
//     break;
//   case "3":
//     dayName = "Wednesday";
//     break;
//   case "4":
//     dayName = "Thursday";
//     break;
//   case "5":
//     dayName = "Friday";
//     break;
//   case "6":
//     dayName = "Saturday";
//     break;
//   case "7":
//     dayName = "Sunday";
//     break;
//   default:
//     dayName = "Invalid day number";
//     break;
// }

// console.log(dayName);




//--------------------------------------------------------------------------------------------------------------------------

let number1 = +prompt("Введіть перше число:", 0);
let number2 = +prompt("Введіть друге число:", 0);

if (number1 > number2) {
  console.log(`Максимальне число: ${number1}`);
} else if (number2 > number1) {
  console.log(`Максимальне число: ${number2}`);
} else if (number1 === number2) {
  console.log(`Числа рівні: ${number1} == ${number2}`);
} else {
    console.log("Невірне значення для number1|number2");
}



//--------------------------------------------------------------------------------------------------------------------------

// let x = 1;

// x = x || "default"


//--------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------