/*
    =========================
    описати колоду карт (від 6 до туза без джокерів)
    - знайти піковий туз
    - всі шістки
    - всі червоні карти
    - всі буби
    - всі трефи від 9 та більше

    {
        cardSuit: '', // 'spade', 'diamond','heart', 'clubs'
        value: '', // '6'-'10', 'ace','jack','queen','king','joker'
        color:'', // 'red','black'
    }

    =========================

    Взяти описану колоду карт, та за допомоги reduce упакувати всі карти по "мастях" в об'єкт
    {
        spades:[],
        diamonds:[],
        hearts:[],
        clubs:[]
    }
    =========================
    взяти з arrays.js (який лежить в папці 2023 plan) масив coursesArray
    --написати пошук всіх об'єктів, в який в modules є sass
    --написати пошук всіх об'єктів, в який в modules є docker

*/